clc;clear;
%%%%2和3次B样条曲线
A=[0 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 85 90 100
    25 20 16 23 24 23 26 25 23 22 22 22 15 27 26 28 26 25 29]; % 控制顶点
l=length(A);
figure(1);%%%3次曲线
plot(A(1,:),A(2,:),'r-o');
title('3次B样条曲线');
hold on;
for i=1:l-3
    for t=0:0.01:1
        array3=[1 4 1 0
            -3 0 3 0
            3 -6 3 0
            -1 3 -3 1];
        vector3=1/6*[1 t t.^2 t.^3];
        B3=vector3*array3;
        x3=B3(1).*A(1,i)+B3(2).*A(1,i+1)+B3(3).*A(1,i+2)+B3(4).*A(1,i+3);%%%%%%%%%%%%%四顶点
        y3=B3(1).*A(2,i)+B3(2).*A(2,i+1)+B3(3).*A(2,i+2)+B3(4).*A(2,i+3);
        line(x3,y3);
    end
end
hold off;
figure(2); %%%2次曲线
%%title('2次B样条曲线');
plot(A(1,:),A(2,:),'r-o');
hold on;
for i=1:l-2
    for t=0:0.001:1
        array2=[1 1 0
            -2 2 0
            1 -2 1];
        vector2=1/2*[1 t t.^2];
        B2=vector2*array2;
        x2=B2(1).*A(1,i)+B2(2).*A(1,i+1)+B2(3).*A(1,i+2);%%%%%%%%%%%%%三顶点
        y2=B2(1).*A(2,i)+B2(2).*A(2,i+1)+B2(3).*A(2,i+2);
        line(x2,y2);
    end
end
